wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/HC32F146KX.h
#define bM0P_MSC5_UART_COMP_COMP3                       *((volatile unsigned int*)(0x426E2A0CUL))
#define bM0P_MSC5_UART_COMP_COMP4                       *((volatile unsigned int*)(0x426E2A10UL))
#define bM0P_MSC5_UART_COMP_COMP5                       *((volatile unsigned int*)(0x426E2A14UL))
#define bM0P_MSC5_UART_COMP_COMP6                       *((volatile unsigned int*)(0x426E2A18UL))
#define bM0P_MSC5_UART_COMP_COMP7                       *((volatile unsigned int*)(0x426E2A1CUL))
#define bM0P_MSC5_UART_COMP_COMP8                       *((volatile unsigned int*)(0x426E2A20UL))
#define bM0P_MSC5_UART_COMP_COMP9                       *((volatile unsigned int*)(0x426E2A24UL))
#define bM0P_MSC5_UART_COMP_CE                          *((volatile unsigned int*)(0x426E2A3CUL))
#define bM0P_MSC6_UART_MR_DOE                           *((volatile unsigned int*)(0x426E4000UL))
#define bM0P_MSC6_UART_MR_TDS                           *((volatile unsigned int*)(0x426E4008UL))
#define bM0P_MSC6_UART_MR_SBLS                          *((volatile unsigned int*)(0x426E400CUL))
#define bM0P_MSC6_UART_MR_MODE0                         *((volatile unsigned int*)(0x426E4014UL))
#define bM0P_MSC6_UART_MR_MODE1                         *((volatile unsigned int*)(0x426E4018UL))
#define bM0P_MSC6_UART_MR_MODE2                         *((volatile unsigned int*)(0x426E401CUL))
#define bM0P_MSC6_UART_CR_TXE                           *((volatile unsigned int*)(0x426E4020UL))
#define bM0P_MSC6_UART_CR_RXE                           *((volatile unsigned int*)(0x426E4024UL))
#define bM0P_MSC6_UART_CR_TBIE                          *((volatile unsigned int*)(0x426E4028UL))
#define bM0P_MSC6_UART_CR_TXIE                          *((volatile unsigned int*)(0x426E402CUL))
#define bM0P_MSC6_UART_CR_RXIE                          *((volatile unsigned int*)(0x426E4030UL))
#define bM0P_MSC6_UART_CR_PCL                           *((volatile unsigned int*)(0x426E403CUL))
#define bM0P_MSC6_UART_ECR_DL0                          *((volatile unsigned int*)(0x426E4080UL))
#define bM0P_MSC6_UART_ECR_DL1                          *((volatile unsigned int*)(0x426E4084UL))
#define bM0P_MSC6_UART_ECR_DL2                          *((volatile unsigned int*)(0x426E4088UL))
#define bM0P_MSC6_UART_ECR_PS                           *((volatile unsigned int*)(0x426E408CUL))
#define bM0P_MSC6_UART_ECR_PE                           *((volatile unsigned int*)(0x426E4090UL))
#define bM0P_MSC6_UART_ECR_INV                          *((volatile unsigned int*)(0x426E4094UL))
#define bM0P_MSC6_UART_ECR_ESBLS                        *((volatile unsigned int*)(0x426E4098UL))
#define bM0P_MSC6_UART_ECR_FCEB                         *((volatile unsigned int*)(0x426E409CUL))
#define bM0P_MSC6_UART_SR_TBIF                          *((volatile unsigned int*)(0x426E40A0UL))
#define bM0P_MSC6_UART_SR_TDEF                          *((volatile unsigned int*)(0x426E40A4UL))
#define bM0P_MSC6_UART_SR_RDFF                          *((volatile unsigned int*)(0x426E40A8UL))
#define bM0P_MSC6_UART_SR_ORF                           *((volatile unsigned int*)(0x426E40ACUL))
#define bM0P_MSC6_UART_SR_FEF                           *((volatile unsigned int*)(0x426E40B0UL))
#define bM0P_MSC6_UART_SR_PEF                           *((volatile unsigned int*)(0x426E40B4UL))
#define bM0P_MSC6_UART_SR_RECLR                         *((volatile unsigned int*)(0x426E40BCUL))
#define bM0P_MSC6_UART_BRS_BRS0                         *((volatile unsigned int*)(0x426E4180UL))
#define bM0P_MSC6_UART_BRS_BRS1                         *((volatile unsigned int*)(0x426E4184UL))
#define bM0P_MSC6_UART_BRS_BRS2                         *((volatile unsigned int*)(0x426E4188UL))
#define bM0P_MSC6_UART_BRS_BRS3                         *((volatile unsigned int*)(0x426E418CUL))
#define bM0P_MSC6_UART_BRS_BRS4                         *((volatile unsigned int*)(0x426E4190UL))
#define bM0P_MSC6_UART_BRS_BRS5                         *((volatile unsigned int*)(0x426E4194UL))
#define bM0P_MSC6_UART_BRS_BRS6                         *((volatile unsigned int*)(0x426E4198UL))
#define bM0P_MSC6_UART_BRS_BRS7                         *((volatile unsigned int*)(0x426E419CUL))
#define bM0P_MSC6_UART_BRS_BRS8                         *((volatile unsigned int*)(0x426E41A0UL))
#define bM0P_MSC6_UART_BRS_BRS9                         *((volatile unsigned int*)(0x426E41A4UL))
#define bM0P_MSC6_UART_BRS_BRS10                        *((volatile unsigned int*)(0x426E41A8UL))
#define bM0P_MSC6_UART_BRS_BRS11                        *((volatile unsigned int*)(0x426E41ACUL))
#define bM0P_MSC6_UART_BRS_BRS12                        *((volatile unsigned int*)(0x426E41B0UL))
#define bM0P_MSC6_UART_BRS_BRS13                        *((volatile unsigned int*)(0x426E41B4UL))
#define bM0P_MSC6_UART_BRS_BRS14                        *((volatile unsigned int*)(0x426E41B8UL))
#define bM0P_MSC6_UART_BRS_EXT                          *((volatile unsigned int*)(0x426E41BCUL))
#define bM0P_MSC6_UART_COMP_COMP0                       *((volatile unsigned int*)(0x426E4A00UL))
#define bM0P_MSC6_UART_COMP_COMP1                       *((volatile unsigned int*)(0x426E4A04UL))
#define bM0P_MSC6_UART_COMP_COMP2                       *((volatile unsigned int*)(0x426E4A08UL))
#define bM0P_MSC6_UART_COMP_COMP3                       *((volatile unsigned int*)(0x426E4A0CUL))
#define bM0P_MSC6_UART_COMP_COMP4                       *((volatile unsigned int*)(0x426E4A10UL))
#define bM0P_MSC6_UART_COMP_COMP5                       *((volatile unsigned int*)(0x426E4A14UL))
#define bM0P_MSC6_UART_COMP_COMP6                       *((volatile unsigned int*)(0x426E4A18UL))
#define bM0P_MSC6_UART_COMP_COMP7                       *((volatile unsigned int*)(0x426E4A1CUL))
#define bM0P_MSC6_UART_COMP_COMP8                       *((volatile unsigned int*)(0x426E4A20UL))
#define bM0P_MSC6_UART_COMP_COMP9                       *((volatile unsigned int*)(0x426E4A24UL))
#define bM0P_MSC6_UART_COMP_CE                          *((volatile unsigned int*)(0x426E4A3CUL))
#define bM0P_OPA0_OPA_CTL_OPA_EN                        *((volatile unsigned int*)(0x42788000UL))
#define bM0P_OPA1_OPA_CTL_OPA_EN                        *((volatile unsigned int*)(0x42789000UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY0                *((volatile unsigned int*)(0x425C0000UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY1                *((volatile unsigned int*)(0x425C0004UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY2                *((volatile unsigned int*)(0x425C0008UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY3                *((volatile unsigned int*)(0x425C000CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY4                *((volatile unsigned int*)(0x425C0010UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY5                *((volatile unsigned int*)(0x425C0014UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY6                *((volatile unsigned int*)(0x425C0018UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY7                *((volatile unsigned int*)(0x425C001CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY8                *((volatile unsigned int*)(0x425C0020UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY9                *((volatile unsigned int*)(0x425C0024UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY10               *((volatile unsigned int*)(0x425C0028UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY11               *((volatile unsigned int*)(0x425C002CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY12               *((volatile unsigned int*)(0x425C0030UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY13               *((volatile unsigned int*)(0x425C0034UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY14               *((volatile unsigned int*)(0x425C0038UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY15               *((volatile unsigned int*)(0x425C003CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY16               *((volatile unsigned int*)(0x425C0040UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY17               *((volatile unsigned int*)(0x425C0044UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY18               *((volatile unsigned int*)(0x425C0048UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY19               *((volatile unsigned int*)(0x425C004CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY20               *((volatile unsigned int*)(0x425C0050UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY21               *((volatile unsigned int*)(0x425C0054UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY22               *((volatile unsigned int*)(0x425C0058UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY23               *((volatile unsigned int*)(0x425C005CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY24               *((volatile unsigned int*)(0x425C0060UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY25               *((volatile unsigned int*)(0x425C0064UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY26               *((volatile unsigned int*)(0x425C0068UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY27               *((volatile unsigned int*)(0x425C006CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY28               *((volatile unsigned int*)(0x425C0070UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY29               *((volatile unsigned int*)(0x425C0074UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY30               *((volatile unsigned int*)(0x425C0078UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY31               *((volatile unsigned int*)(0x425C007CUL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM0                *((volatile unsigned int*)(0x425C0080UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM1                *((volatile unsigned int*)(0x425C0084UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM2                *((volatile unsigned int*)(0x425C0088UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM3                *((volatile unsigned int*)(0x425C008CUL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM4                *((volatile unsigned int*)(0x425C0090UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM5                *((volatile unsigned int*)(0x425C0094UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM6                *((volatile unsigned int*)(0x425C0098UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM7                *((volatile unsigned int*)(0x425C009CUL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM0                *((volatile unsigned int*)(0x425C0100UL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM1                *((volatile unsigned int*)(0x425C0104UL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM2                *((volatile unsigned int*)(0x425C0108UL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM3                *((volatile unsigned int*)(0x425C010CUL))
#define bM0P_OSC_CTL_HICR_FDIV_FDIV0                    *((volatile unsigned int*)(0x425C0200UL))
#define bM0P_OSC_CTL_HICR_FDIV_FDIV1                    *((volatile unsigned int*)(0x425C0204UL))
#define bM0P_OSC_CTL_HICR_FDIV_FDIV2                    *((volatile unsigned int*)(0x425C0208UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HXSEL0                 *((volatile unsigned int*)(0x425C0400UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HXSEL1                 *((volatile unsigned int*)(0x425C0404UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HIBS0                  *((volatile unsigned int*)(0x425C0440UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HIBS1                  *((volatile unsigned int*)(0x425C0444UL))
#define bM0P_OSC_CTL_LSXT_PWRCTL_LIBS0                  *((volatile unsigned int*)(0x425C0640UL))
#define bM0P_OSC_CTL_LSXT_PWRCTL_LIBS1                  *((volatile unsigned int*)(0x425C0644UL))
#define bM0P_OSC_CTL_LSXT_PWRCTL_LIBS2                  *((volatile unsigned int*)(0x425C0648UL))
#define bM0P_PARITY_PARITY_CTL_PE                       *((volatile unsigned int*)(0x42780000UL))
#define bM0P_PARITY_PARITY_CTL_PIE                      *((volatile unsigned int*)(0x42780004UL))
#define bM0P_PARITY_PARITY_CTL_PERROR                   *((volatile unsigned int*)(0x42780010UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR0                   *((volatile unsigned int*)(0x42780080UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR1                   *((volatile unsigned int*)(0x42780084UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR2                   *((volatile unsigned int*)(0x42780088UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR3                   *((volatile unsigned int*)(0x4278008CUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR4                   *((volatile unsigned int*)(0x42780090UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR5                   *((volatile unsigned int*)(0x42780094UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR6                   *((volatile unsigned int*)(0x42780098UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR7                   *((volatile unsigned int*)(0x4278009CUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR8                   *((volatile unsigned int*)(0x427800A0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR9                   *((volatile unsigned int*)(0x427800A4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR10                  *((volatile unsigned int*)(0x427800A8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR11                  *((volatile unsigned int*)(0x427800ACUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR12                  *((volatile unsigned int*)(0x427800B0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR13                  *((volatile unsigned int*)(0x427800B4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR14                  *((volatile unsigned int*)(0x427800B8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR15                  *((volatile unsigned int*)(0x427800BCUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR16                  *((volatile unsigned int*)(0x427800C0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR17                  *((volatile unsigned int*)(0x427800C4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR18                  *((volatile unsigned int*)(0x427800C8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR19                  *((volatile unsigned int*)(0x427800CCUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR20                  *((volatile unsigned int*)(0x427800D0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR21                  *((volatile unsigned int*)(0x427800D4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR22                  *((volatile unsigned int*)(0x427800D8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR23                  *((volatile unsigned int*)(0x427800DCUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR24                  *((volatile unsigned int*)(0x427800E0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR25                  *((volatile unsigned int*)(0x427800E4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR26                  *((volatile unsigned int*)(0x427800E8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR27                  *((volatile unsigned int*)(0x427800ECUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR28                  *((volatile unsigned int*)(0x427800F0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR29                  *((volatile unsigned int*)(0x427800F4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR30                  *((volatile unsigned int*)(0x427800F8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR31                  *((volatile unsigned int*)(0x427800FCUL))
#define bM0P_PCG_CLKEN0_MSC4CK                          *((volatile unsigned int*)(0x42782010UL))
#define bM0P_PCG_CLKEN0_MSC5CK                          *((volatile unsigned int*)(0x42782014UL))
#define bM0P_PCG_CLKEN0_MSC6CK                          *((volatile unsigned int*)(0x42782018UL))
#define bM0P_PCG_CLKEN0_ADCCK                           *((volatile unsigned int*)(0x42782040UL))
#define bM0P_PCG_CLKEN0_DMACK                           *((volatile unsigned int*)(0x42782060UL))
#define bM0P_PCG_CLKEN0_GIOCK                           *((volatile unsigned int*)(0x42782070UL))
#define bM0P_PCG_RSTCTL0_MSC4RST                        *((volatile unsigned int*)(0x42782090UL))
#define bM0P_PCG_RSTCTL0_MSC5RST                        *((volatile unsigned int*)(0x42782094UL))
#define bM0P_PCG_RSTCTL0_MSC6RST                        *((volatile unsigned int*)(0x42782098UL))
#define bM0P_PCG_RSTCTL0_ADCRST                         *((volatile unsigned int*)(0x427820C0UL))
#define bM0P_PCG_RSTCTL0_DMARST                         *((volatile unsigned int*)(0x427820E0UL))
#define bM0P_PCG_CLKEN1_CTCK                            *((volatile unsigned int*)(0x42782200UL))
#define bM0P_PCG_CLKEN1_VCCK                            *((volatile unsigned int*)(0x42782210UL))
#define bM0P_PCG_CLKEN1_TM4CK                           *((volatile unsigned int*)(0x42782220UL))
#define bM0P_PCG_CLKEN1_OPA0CK                          *((volatile unsigned int*)(0x42782230UL))
#define bM0P_PCG_CLKEN1_OPA1CK                          *((volatile unsigned int*)(0x42782234UL))
#define bM0P_PCG_RSTCTL1_CTMRST                         *((volatile unsigned int*)(0x42782280UL))
#define bM0P_PCG_RSTCTL1_VCRST                          *((volatile unsigned int*)(0x42782290UL))
#define bM0P_PCG_RSTCTL1_TM4RST                         *((volatile unsigned int*)(0x427822A0UL))
#define bM0P_PCG_RSTCTL1_OPA0RST                        *((volatile unsigned int*)(0x427822B0UL))
#define bM0P_PCG_RSTCTL1_OPA1RST                        *((volatile unsigned int*)(0x427822B4UL))
#define bM0P_PCG_CLKEN2_LCDCCK                          *((volatile unsigned int*)(0x42782440UL))
#define bM0P_PCG_RSTCTL2_LCDCRST                        *((volatile unsigned int*)(0x427824C0UL))
#define bM0P_SWWDT_WDT_CTL_IE                           *((volatile unsigned int*)(0x42240100UL))
#define bM0P_SWWDT_WDT_CTL_RSTEN                        *((volatile unsigned int*)(0x42240104UL))
#define bM0P_SWWDT_WDT_CTL_TMWD0                        *((volatile unsigned int*)(0x42240108UL))
#define bM0P_SWWDT_WDT_CTL_TMWD1                        *((volatile unsigned int*)(0x4224010CUL))
#define bM0P_SWWDT_WDT_CTL_WDM                          *((volatile unsigned int*)(0x42240110UL))
#define bM0P_SWWDT_WDT_STA_STA                          *((volatile unsigned int*)(0x42240200UL))
#define bM0P_SWWDT_WDT_MDC_TRG                          *((volatile unsigned int*)(0x42240300UL))
#define bM0P_UID_UIDR0_UID0                             *((volatile unsigned int*)(0x42002000UL))
#define bM0P_UID_UIDR0_UID1                             *((volatile unsigned int*)(0x42002004UL))
#define bM0P_UID_UIDR0_UID2                             *((volatile unsigned int*)(0x42002008UL))
#define bM0P_UID_UIDR0_UID3                             *((volatile unsigned int*)(0x4200200CUL))
#define bM0P_UID_UIDR0_UID4                             *((volatile unsigned int*)(0x42002010UL))
#define bM0P_UID_UIDR0_UID5                             *((volatile unsigned int*)(0x42002014UL))
#define bM0P_UID_UIDR0_UID6                             *((volatile unsigned int*)(0x42002018UL))
#define bM0P_UID_UIDR0_UID7                             *((volatile unsigned int*)(0x4200201CUL))
#define bM0P_UID_UIDR0_UID8                             *((volatile unsigned int*)(0x42002020UL))
#define bM0P_UID_UIDR0_UID9                             *((volatile unsigned int*)(0x42002024UL))
#define bM0P_UID_UIDR0_UID10                            *((volatile unsigned int*)(0x42002028UL))
#define bM0P_UID_UIDR0_UID11                            *((volatile unsigned int*)(0x4200202CUL))
#define bM0P_UID_UIDR0_UID12                            *((volatile unsigned int*)(0x42002030UL))
#define bM0P_UID_UIDR0_UID13                            *((volatile unsigned int*)(0x42002034UL))
#define bM0P_UID_UIDR0_UID14                            *((volatile unsigned int*)(0x42002038UL))
#define bM0P_UID_UIDR0_UID15                            *((volatile unsigned int*)(0x4200203CUL))
#define bM0P_UID_UIDR0_UID16                            *((volatile unsigned int*)(0x42002040UL))
#define bM0P_UID_UIDR0_UID17                            *((volatile unsigned int*)(0x42002044UL))
#define bM0P_UID_UIDR0_UID18                            *((volatile unsigned int*)(0x42002048UL))
#define bM0P_UID_UIDR0_UID19                            *((volatile unsigned int*)(0x4200204CUL))
#define bM0P_UID_UIDR0_UID20                            *((volatile unsigned int*)(0x42002050UL))
#define bM0P_UID_UIDR0_UID21                            *((volatile unsigned int*)(0x42002054UL))
#define bM0P_UID_UIDR0_UID22                            *((volatile unsigned int*)(0x42002058UL))
#define bM0P_UID_UIDR0_UID23                            *((volatile unsigned int*)(0x4200205CUL))
#define bM0P_UID_UIDR0_UID24                            *((volatile unsigned int*)(0x42002060UL))
#define bM0P_UID_UIDR0_UID25                            *((volatile unsigned int*)(0x42002064UL))
#define bM0P_UID_UIDR0_UID26                            *((volatile unsigned int*)(0x42002068UL))
#define bM0P_UID_UIDR0_UID27                            *((volatile unsigned int*)(0x4200206CUL))
#define bM0P_UID_UIDR0_UID28                            *((volatile unsigned int*)(0x42002070UL))
#define bM0P_UID_UIDR0_UID29                            *((volatile unsigned int*)(0x42002074UL))
#define bM0P_UID_UIDR0_UID30                            *((volatile unsigned int*)(0x42002078UL))
#define bM0P_UID_UIDR0_UID31                            *((volatile unsigned int*)(0x4200207CUL))
#define bM0P_UID_UIDR1_UID0                             *((volatile unsigned int*)(0x42002080UL))
#define bM0P_UID_UIDR1_UID1                             *((volatile unsigned int*)(0x42002084UL))
#define bM0P_UID_UIDR1_UID2                             *((volatile unsigned int*)(0x42002088UL))
#define bM0P_UID_UIDR1_UID3                             *((volatile unsigned int*)(0x4200208CUL))
#define bM0P_UID_UIDR1_UID4                             *((volatile unsigned int*)(0x42002090UL))
#define bM0P_UID_UIDR1_UID5                             *((volatile unsigned int*)(0x42002094UL))
#define bM0P_UID_UIDR1_UID6                             *((volatile unsigned int*)(0x42002098UL))
#define bM0P_UID_UIDR1_UID7                             *((volatile unsigned int*)(0x4200209CUL))
#define bM0P_UID_UIDR1_UID8                             *((volatile unsigned int*)(0x420020A0UL))
#define bM0P_UID_UIDR1_UID9                             *((volatile unsigned int*)(0x420020A4UL))
#define bM0P_UID_UIDR1_UID10                            *((volatile unsigned int*)(0x420020A8UL))
#define bM0P_UID_UIDR1_UID11                            *((volatile unsigned int*)(0x420020ACUL))
#define bM0P_UID_UIDR1_UID12                            *((volatile unsigned int*)(0x420020B0UL))
#define bM0P_UID_UIDR1_UID13                            *((volatile unsigned int*)(0x420020B4UL))
#define bM0P_UID_UIDR1_UID14                            *((volatile unsigned int*)(0x420020B8UL))
#define bM0P_UID_UIDR1_UID15                            *((volatile unsigned int*)(0x420020BCUL))
#define bM0P_UID_UIDR1_UID16                            *((volatile unsigned int*)(0x420020C0UL))
#define bM0P_UID_UIDR1_UID17                            *((volatile unsigned int*)(0x420020C4UL))
#define bM0P_UID_UIDR1_UID18                            *((volatile unsigned int*)(0x420020C8UL))
#define bM0P_UID_UIDR1_UID19                            *((volatile unsigned int*)(0x420020CCUL))
#define bM0P_UID_UIDR1_UID20                            *((volatile unsigned int*)(0x420020D0UL))
#define bM0P_UID_UIDR1_UID21                            *((volatile unsigned int*)(0x420020D4UL))
#define bM0P_UID_UIDR1_UID22                            *((volatile unsigned int*)(0x420020D8UL))
#define bM0P_UID_UIDR1_UID23                            *((volatile unsigned int*)(0x420020DCUL))
#define bM0P_UID_UIDR1_UID24                            *((volatile unsigned int*)(0x420020E0UL))
#define bM0P_UID_UIDR1_UID25                            *((volatile unsigned int*)(0x420020E4UL))
#define bM0P_UID_UIDR1_UID26                            *((volatile unsigned int*)(0x420020E8UL))
#define bM0P_UID_UIDR1_UID27                            *((volatile unsigned int*)(0x420020ECUL))
#define bM0P_UID_UIDR1_UID28                            *((volatile unsigned int*)(0x420020F0UL))
